import styled from '@emotion/styled';
import { Colors } from 'styles/Colors';
import { FontFamily, FontSize } from 'styles/FontStyles';
export default function DetailDelivery() {
  return (
    <Wrap>
      <p>배송/반품/교환 정보 </p>
      <dl>
        <dt>배송지역</dt>
        <dd>ㆍ전국 가능(군부대 일부 지역은 제외)</dd>
        <dd>ㆍ도서산간지역 추가비용 없음</dd>
      </dl>

      <dl>
        <dt>배송기간</dt>
        <dd>
          ㆍ입금확인 후 2~4일 가량 소요되며, 지역에 따라 약간의 차이가 있을 수
          있습니다. (연휴, 공휴일, 일부 도서지역 및 사서함 주소는 2~3일 추가
          소요 예상됩니다.)
        </dd>
        <dd></dd>
      </dl>

      <dl>
        <dt>배송비</dt>
        <dd>
          ㆍ최종 결제금액이 15,000원 미만 주문 시 배송비 2,500원이 부과됩니다.
        </dd>
        <dd>
          ㆍ교환 및 반품 시에는 교환 배송비 5,000원, 반품 배송비 2,500원이
          부과됩니다.
        </dd>
        <dd> ㆍ교환/반품비 입금 확인 후 교환/반품이 진행됩니다.</dd>
        <dd> ㆍ반품 및 교환 입금 계좌: 우리은행 1005-102-622-822</dd>
      </dl>

      <dl>
        <dt>교환/반품이 가능한 경우</dt>
        <dd>
          ㆍ단순 변심, 착오 구매에 따른 교환/반품은 상품을 공급받은 날부터 10일
          이내에 가능합니다. (배송비 2,500원 소비자 부담)
        </dd>
        <dd>
          ㆍ단, 포장을 개봉하였거나 포장이 훼손되어 상품가치가 상실된 경우에는
          교환 및 반품이 불가능합니다. (상품 확인을 위하여 포장 훼손한 경우는
          제외)
        </dd>
        <dd>
          ㆍ공급 받으신 상품 내용이 표기, 광고내용과 다르거나 다르게 이행된
          경우에는 그 상품을 공급받은 날부터 3개월 이내, 그 사실을 안 날 또는 알
          수 있었던 날부터 30일 이내 청약철회가 가능합니다. (반품/교환 배송비
          회사 부담)
        </dd>
        <dd>
          ㆍ반품 시 상품대금 환불은 상품 회수 및 청약철회가 확정된 날로부터
          3영업일 이내 진행되며, 기한을 초과한 경우 지연기간에 대하여 연 100분의
          20을 곱하여 산정한 지연이자를 지급합니다.
        </dd>
      </dl>
      <dl>
        <dt>교환/반품이 불가능한 경우</dt>
        <dd>
          ㆍ소비자에게 책임이 있는 사유로 재화 등이 멸실되거나 훼손된 경우(재화
          등의 내용을 확인하기 위하여 포장 등을 훼손한 경우는 제외) ㆍ소비자의
          사용 또는 일부 소비로 재화 등의 가치가 현저히 감소한 경우 ㆍ시간이
          지나 다시 판매하기 곤란할 정도로 재화 등의 가치가 현저히 감소한 경우
          ㆍ복제가 가능한 재화 등의 포장을 훼손한 경우 ㆍ소비자의 주문에 따라
          개별적으로 생산되는 재화 등 또는 이와 유사한 재화 등에 대하여 청약철회
          등을 인정하는 경우 통신판매업자에게 회복할 수 없는 중대한 피해가
          예상되는 경우로서 사전에 해당 거래에 대하여 별도로 그 사실을 고지하고
          소비자의 서면(전자문서 포함)에 의한 동의를 받은 경우
        </dd>
      </dl>
      <dl>
        <dt>주의사항</dt>
        <dd>
          ㆍ상품당 1회 최대 30개까지 주문할 수 있으며, 해당 상품에 대한
          주문횟수는 1 아이디(ID) 당 1일 최대 3회로 제한합니다. (고객 배송정보를
          고려하여 동일 또는 사실상 동일 주소지일 경우에는 1인 고객으로 집계할
          수 있습니다.
        </dd>
        <dd>
          ㆍ주문한 상품이 장기 품절되는 경우 SMS 안내와 함께 자동 주문취소 및
          환불 처리가 진행됩니다.
        </dd>
        <dd>
          ㆍ상품 교환/반품시에는 고객상담실(080-033-5454)로 문의하신 후
          보내주셔야 원활히 처리됩니다. 상담시간: 9:00 ~ 12:00 / 13:00~17:00
          (토,일,공휴일 휴무) 반품 시 증정사은품까지 함께 동봉하여 보내주셔야
          합니다.
        </dd>
        <dd>
          ㆍ택배는 CJ 택배를 꼭 이용해주시기 바랍니다. (타 택배 이용시 반품 및
          교환이 지연되거나 추가 비용이 발생 될 수 있습니다.)
        </dd>
        <dd>
          ㆍ반송주소: 서울시 구로구 디지털로 300 뉴비즈플라자 13층 코드캠프
          온라인사업부 앞.
        </dd>
        <dd>
          ㆍ구매자가 미성년자인 경우에는 상품 구입 시 법정대리인이 동의하지
          아니하면 미성년자 본인 또는 법정대리인이 구매 취소할 수 있습니다.
          ㆍ거래에 관한 이용약관은 본 쇼핑몰 하단의 사이트 이용약관을 통해
          확인하실 수 있습니다.
        </dd>
      </dl>
    </Wrap>
  );
}

const Wrap = styled.div`
  padding: 40px 20px;
  p {
    font-family: ${FontFamily.BOLD};
    font-size: ${FontSize.MEDIUM_T};
    color: ${Colors.B100};
    margin-bottom: 30px;
  }
  dl {
    margin-bottom: 20px;
    dt {
      font-family: ${FontFamily.SEMIBOLD};
      font-size: ${FontSize.SMALL};
      color: ${Colors.B100};
      margin-bottom: 10px;
    }
    dd {
      font-family: ${FontFamily.MEDIUM};
      font-size: ${FontSize.SMALL};
      color: ${Colors.B100};
      text-indent: -13px;
      padding-left: 10px;
      line-height: 1.8;
    }
  }
`;
