export const CONTENT = [
  {
    page: 'market',
    placeholder:
      '내용을 입력해주세요\n\n* 상품에 대한 내용을 상세하게 작성 부탁드립니다.\n* 저작권 침해, 음란, 청소년 유해물, 기타 위법자료 등을 게시할 경우 게시물은 경고 없이 삭제됩니다.',
  },
  {
    page: 'activity',
    placeholder:
      '내용을 입력해주세요\n\n* 액티비티에 대한 내용을 상세하게 작성 부탁드립니다.\n* 저작권 침해, 음란, 청소년 유해물, 기타 위법자료 등을 게시할 경우 게시물은 경고 없이 삭제됩니다.',
  },
  {
    page: 'support',
    placeholder:
      '내용을 입력해주세요\n\n* 후원에 대한 내용을 상세하게 작성 부탁드립니다.\n* 저작권 침해, 음란, 청소년 유해물, 기타 위법자료 등을 게시할 경우 게시물은 경고 없이 삭제됩니다.',
  },
];

export const PLACEHOLDER = [
  '내용을 입력해주세요\n\n* 상품에 대한 내용을 상세하게 작성 부탁드립니다.\n* 저작권 침해, 음란, 청소년 유해물, 기타 위법자료 등을 게시할 경우 게시물은 경고 없이 삭제됩니다.',

  '내용을 입력해주세요\n\n* 액티비티에 대한 내용을 상세하게 작성 부탁드립니다.\n* 저작권 침해, 음란, 청소년 유해물, 기타 위법자료 등을 게시할 경우 게시물은 경고 없이 삭제됩니다.',

  '내용을 입력해주세요\n\n* 후원에 대한 내용을 상세하게 작성 부탁드립니다.\n* 저작권 침해, 음란, 청소년 유해물, 기타 위법자료 등을 게시할 경우 게시물은 경고 없이 삭제됩니다.',
];
